var data = {
    '1': {
        location:[103.7669274801,35.9735229194],
        time: '1939年4月',
        add: '兰州（兰州西南部西果园 , 距城区12.5公里',
        action: '创建',
        name: '西北技艺专科学校。',
        desc: '经国民政府行政院决定在兰州，'
    },
    '2': {
        location: [103.7669274801,35.9735229194],
        time: '1945年8月',
        action: '更名为',
        add: '兰州（兰州西南部西果园 , 距城区12.5公里）',
        name: '国立西北农业专科学校。',
        desc: '奉教育部令，将国立西北技艺专科学校'
    },
    '3':{
        location: [103.7669274801,35.9735229194],
        time: '1946年',
        action: '设立',
        add: '兰州（兰州西南部西果园 , 距城区12.5公里）',
        name: '立国立兽医学院。',
        desc: '经国民政府教育部批准，在兰州，'
    },
    '4':{
        location: [103.7669274801,35.9735229194],
        time: '1947年7月',
        action: '改名为',
        add: '兰州（兰州西南部西果园 , 距城区12.5公里）',
        name: '国立西北农业专科学校。',
        desc: '由国民政府及其教育部直接领导，甘肃省政府协助,'
    },
    '5': {
        location: [103.7811215022,36.0661162827],
        time: '1947年10月',
        action:'成立',
        add: '兰州（兰州小西湖新院址独立办学）',
        name: '国立兽医学院。',
        desc: '1946年,经国民政府教育部批准,在兰州设立国立兽医学院,这是国内首座独立的国立兽医高等学校，'
    },
    '6': {
        location: [103.7811215022,36.0661162827],
        time: '1950年',
        action: '改名为',
        add: '兰州（兰州小西湖新院址独立办学）',
        name: '西北兽医学院。',
        desc: ''
    },
    '7': {
        location: [103.7811215022,36.0661162827],
        time: '1951年',
        action: '更名为',
        add: '兰州（兰州市七里河区小西湖,地处兰州市交通主干线闹市区）',
        name: '西北畜牧兽医学院。',
        desc: ''
    },
    '8': {
        location: [103.7811215022,36.0661162827],
        time: '1951年',
        action: '改名为',
        add: '兰州（兰州市七里河区小西湖,地处兰州市交通主干线闹市区）',
        name: '西北畜牧兽医学院。',
        desc: '西北兽医学院'
    },
    '9': {
        location: [102.8563144653,37.6766629525],
        time: '1952年9月30日',
        action: '并入',
        add: '兰州（兰州市七里河区小西湖,地处兰州市交通主干线闹市区）',
        name: '西北畜牧兽医学院。',
        desc: '西北农学院畜牧兽医系'
    },
    '10': {
        location: [102.8563144653,37.6766629525],
        time: '1958年12月15日',
        action: '续办',
        add: '武威市黄羊镇（西北畜牧兽医学院迁到武威市黄羊镇）',
        name: '西北畜牧兽医学院。',
        desc: '西北畜牧兽医学院从兰州迁到武威市黄羊镇，'
    },
    '11': {
        location: [103.7007957604,36.0906037529],
        time: '1958年12月15日',
        action: '合并并成立',
        add: '武威黄羊镇办学（西北畜牧兽医学院迁到武威市黄羊镇）',
        name: '甘肃农业大学。',
        desc: '学校与筹建中的甘肃农学院'
    },
    '12': {
        location: [103.7007957604,36.0906037529],
        time: '1981年12月12日至今',
        action: '创建',
        add: '兰州市（安宁区营门滩作为农大迁建校址）',
        name: '甘肃农业大学。',
        desc: '经国务院批准学校迁回兰州市办学，'
    }

};
